import React from 'react'
import { Container, Box, Typography } from '@mui/material'
import { Scrollbars } from 'react-custom-scrollbars-2'
import { redColor } from '../../config/constants'

const mainPaper = {
  maxHeight: 'calc(100vh - 200px)',
  overflow: 'hidden',
  display: 'flex',
  flexDirection: 'column',
  backgroundColor: 'white',
  border: '1px solid black',
  p: 2,
}

const AboutClub = () => {
  return (
    <Container sx={{maxWidth: '1366px !important', marginTop: 3, pl: 2, pr: 2}} disableGutters={true}>
      <Box sx={mainPaper}>
        <Box display='flex' alignItems='center' justifyContent='flex-end' borderBottom={1} borderColor={redColor} mb={1}>
          <Typography fontFamily='CorsaGrotesk' color={redColor} variant='h5' pb={0.5}>За клуба</Typography>
        </Box>
        <Scrollbars style={{height: '100vh', padding: 16, paddingTop: 0, marginLeft: -16}}>
          <Box p={2} pt={0}>
            Спортен Клуб СК.Червена звезда – София е учреден на 26.11.2002г. в град София.
            <br/>
            За Председател и Секретар съответно бяха избрани Пламен Гълъбов и Микулаш Фурнаджиев. Завършили Национална Спортна Академия „Васил Левски” гр.София Клуб СК.червена звезда – София е вписан в националния регистър на лицензираните спортни организации и членуващите в тях спортни клубове под №1-074-008 / 30.03.2004, като член на "Българска
                Федерация по Хокей Лед". Целитe на клуба са да развива и пополизира хокея на лед и ин-лаин хокея на територията на София.
            <p/>            
            Със създаването на спортен клуб СК “Червена Звезда-София” се цели последователно и устойчиво развитие на комплекс от социални, управленски, методически, материално-технически, маркетингови и финансови условия за перспективно изграждане на надеждна система,
                която да повиши интереса и желанието на децата да се занимават активно с хокей на лед и ин-лайн хокей, на територията на град София.
            Целта на този процес е чрез прилагане на съвременни ефективни форми и средства , тренировки , състезания и турнири по хокей на лед и ин-лайн хокей да се постигне :
            <ul>
                <li>подобряването на здравето, физическото развитие и дееспособността на децата .</li>
                <li>разработване на целеви програми за насочени към по голяма част от децата чрез подходящи условия и форми за системни занимания по хокей на лед и ин – лайн хокей.</li>
                <li>по нататъшно утвърждаване на хокейната игра като средство за отдих,развлечение, емоционално преживяване и пълноценно използване на свободното време.</li>
                <li>възходящо издигане на спортно-техническото равнище на децата в представителния отбор на СК”Червена Звезда-София” с оглед постигане на високи спортни резултати, на регионално равнище.</li>
            </ul>
            <p/>
            Това извежда на преден план необходимостта от тясно взаимодействие на СК” Червена Звезда-София”с Министерството на младежта и спорта, Българска Федерация по Хокей на Лед, областните и общински администрации, Българския олимпийски комитет, българските
                спортни федерации, спортните или обединени спортни клубове и други не правителствени организации.
            
            <p/>
            Осъществяването на дейноста СК” Червена Звезда-София” цели да осигури условия за системни спортни занимания на децата и младите хора , които да изградят у тях уважение към здравето и живота, силен характер, воля за победа, чувство за отговорност и умения
                за работа в екип. Изграждането на тези личностни качества са предпоставка за пълноценната им реализация в обществото.
            <ul>
                <li>разширяване обхвата на деца в обучение и практикуване на хокейната игра.</li>
                <li>създаване маркетингова система (в т.ч. реализация на услуги, реклама и др.) осигуряващи необходимите финансови постъпления.</li>
                <li>обезпечаване и координиране усилията на СК” Червена Звезда-София”с държавни, общински и частни организации, за изграждане, подържане, реконструкция и модернизация на спортните съоръжения за обучение, тренировъчна и спортно състезателна дейност.</li>
            </ul>
            <p/>
            Треньорите в хокей клуб СК.червена звезда – София
            <br/>
            В хокей клуб СК.червена звезда – София , залагаме на специалисти завършили висше спортно образование,който да се занимават професионално със спортистите в клуба.
            <ul>
              <li>Пламен Гълъбов - Завършил Национална Спортна Академия</li>
              <li>Микулаш Фурнаджиев - Завършил Национална Спортна Академия</li>
            </ul>
          </Box>
        </Scrollbars>
      </Box>
    </Container>
  )
}

export default AboutClub